{
  "Academic Reputation and Ranking": [
    "How does the university define and measure its academic reputation?",
    "What specific ranking systems does the university pay attention to, and why?",
    "How has the university's ranking trended over the past 5-10 years in major global rankings?",
    "What strategies does the university employ to improve its academic reputation and ranking?",
    "Are there specific departments or programs within the university that are particularly highly regarded nationally or internationally?",
    "How does the university's research output and impact contribute to its academic reputation?",
    "Does the university actively seek accreditation from reputable academic bodies?",
    "How does the university's alumni network contribute to its reputation and career prospects for graduates?",
    "What is the student-to-faculty ratio, and how does this impact the quality of education?",
    "Beyond rankings, what other indicators of academic excellence does the university prioritize?"
  ],
  "Specific Program Strengths (e.g., Engineering, Design)": [
    "What specific areas within engineering does your program excel in (e.g., robotics, sustainable energy, biomedical)?",
    "What are some recent successful projects or research initiatives undertaken by students or faculty in the engineering department?",
    "How does the program integrate hands-on learning experiences, such as labs, workshops, or internships?",
    "What kind of industry partnerships does the engineering program have, and how do these benefit students?",
    "What resources and facilities are available to engineering students, such as specialized labs, software, or equipment?",
    "How does the program support students in developing skills beyond technical knowledge, such as communication, teamwork, and leadership?",
    "What is the faculty-to-student ratio in engineering courses, and how accessible are professors for mentorship and guidance?",
    "What career services and resources are available specifically for engineering students to help with job placement after graduation?",
    "What opportunities are there for undergraduate students to participate in research alongside faculty members?",
    "How does the curriculum adapt to the rapidly evolving landscape of the engineering field and emerging technologies?"
  ],
  "Faculty Expertise and Research Opportunities": [
    "What are the primary research areas of the faculty in this department?",
    "Are there opportunities for undergraduate students to participate in faculty research projects?",
    "How do I find out which faculty members are accepting undergraduate research assistants?",
    "What kind of support (funding, mentorship, resources) is available for undergraduate researchers?",
    "Are there specific faculty members known for mentoring undergraduate researchers particularly well?",
    "What percentage of undergraduate students in this department typically participate in research?",
    "Does the university offer any programs specifically designed to connect students with research opportunities?",
    "What are the typical time commitments involved in undergraduate research projects?",
    "Are there opportunities to present research findings at conferences or in publications?",
    "How does research experience typically benefit students applying to graduate school or jobs?"
  ],
  "Hands-on Learning and Project-Based Curriculum": [
    "What types of hands-on projects are typically offered within my major (e.g., engineering, computer science, etc.)?",
    "Are there opportunities to work on real-world projects with industry partners or local organizations?",
    "How is project-based learning integrated into the core curriculum, and what percentage of my grade will it contribute?",
    "What resources and support are available to students working on projects, such as lab access, mentorship, or funding?",
    "Are there opportunities to present or showcase completed projects, such as at conferences or university events?",
    "How are students assessed on their project work? Is it purely based on the final product, or are process and teamwork also considered?",
    "What is the average team size for project-based assignments, and how are teams formed?",
    "Can I propose my own project ideas, or are projects typically assigned by instructors?",
    "Are there any specific courses or programs that focus heavily on hands-on learning and project development?",
    "What are some examples of successful student projects that have come out of this curriculum?"
  ],
  "Internship Opportunities and Industry Connections": [
    "What types of internships are typically available to students in my major?",
    "Does the university have partnerships with specific companies for internships?",
    "How does the university support students in finding and applying for internships?",
    "Are internships typically paid or unpaid?",
    "What resources are available to help students prepare for internship interviews?",
    "Does the university offer any academic credit for completing an internship?",
    "What is the average length of an internship?",
    "Are there opportunities for international internships?",
    "How does the university facilitate networking events with industry professionals?",
    "What percentage of graduates secure full-time employment with companies they interned with?"
  ],
  "Career Services and Graduate Employment Rate": [
    "What is the graduate employment rate for students in my specific major (e.g., Computer Science)?",
    "What types of career services are available to students, such as resume workshops, mock interviews, and career fairs?",
    "Does the Career Services department offer personalized career counseling and advising?",
    "How does the university connect students with potential employers and internship opportunities?",
    "What resources are available to help students explore different career paths and industries?",
    "Are there specific programs or initiatives designed to support international students in their job search?",
    "What is the average starting salary for graduates in my field from this university?",
    "Does the university track graduate employment data beyond the first year after graduation?",
    "How does the Career Services department collaborate with academic departments to ensure students are prepared for the workforce?",
    "Are there opportunities for students to network with alumni working in their desired fields?"
  ],
  "Tuition Fees and Financial Aid Options": [
    "What is the total cost of tuition per year for my program (Computer Science)?",
    "What types of financial aid are available to international students?",
    "What is the deadline to apply for financial aid?",
    "Does the university offer any merit-based scholarships?",
    "Are there any work-study programs available on campus?",
    "What is the average financial aid package awarded to students in my program?",
    "What is the process for appealing a financial aid decision?",
    "Are tuition fees fixed for the duration of my program, or are they subject to change?",
    "Does the university offer payment plans for tuition fees?",
    "What are the eligibility requirements for different types of financial aid (e.g., need-based grants)?"
  ],
  "Scholarship Availability and Eligibility Criteria": [
    "What types of scholarships are available to incoming freshmen?",
    "What are the general academic requirements (GPA, test scores) for scholarship eligibility?",
    "Are there scholarships specifically for students in my intended major (e.g., engineering)?",
    "Does the university offer need-based scholarships, and how is financial need determined?",
    "What is the application process for scholarships, and is it separate from the general university application?",
    "What are the deadlines for scholarship applications?",
    "Are there any scholarships specifically for out-of-state or international students?",
    "Do scholarships cover the full cost of tuition, or are they partial awards?",
    "Are scholarships renewable, and what are the requirements for maintaining them?",
    "Where can I find a comprehensive list of all available scholarships and their specific requirements?"
  ],
  "Cost of Living in Singapore": [
    "What is the average monthly rent for a student apartment near the university?",
    "How much should I budget for food each month, considering both eating out and cooking at home?",
    "Are there any student discounts available for transportation, and what is the average cost of public transport per month?",
    "What is the estimated cost of textbooks and other academic materials per semester?",
    "How much should I budget for personal expenses like toiletries, clothing, and entertainment?",
    "Are there any hidden costs associated with living in Singapore that I should be aware of?",
    "What are some affordable neighborhoods or areas to live in as a student?",
    "How does the cost of living in Singapore compare to other major cities?",
    "Are there any financial aid programs or scholarships available to help cover the cost of living?",
    "What are the average utility costs (electricity, water, internet) per month for a student apartment?"
  ],
  "Accommodation Options (on-campus and off-campus)": [
    "What types of on-campus accommodation are available (e.g., dorms, apartments, suites)?",
    "What is the average cost of on-campus accommodation per semester or year, and what does that include (utilities, internet, etc.)?",
    "What are the key differences between on-campus and off-campus accommodation in terms of cost, convenience, and social life?",
    "Are there specific on-campus residences designated for certain programs or year levels?",
    "What off-campus housing options are popular among students, and how far are they from campus?",
    "What resources does the university provide to help students find off-campus housing (e.g., listings, roommate matching)?",
    "What are the typical lease terms for off-campus housing in the area?",
    "What safety measures are in place for both on-campus and off-campus accommodation?",
    "Are there resident advisors or other support staff available in on-campus residences?",
    "What is the application process and timeline for on-campus accommodation, and what are the chances of getting my preferred choice?"
  ],
  "Campus Facilities and Resources (labs, library, maker spaces)": [
    "What are the opening hours of the main library, and are there any 24/7 study spaces available?",
    "What types of specialized labs are available for students in [mention specific major]? (e.g., wet labs, computer labs, engineering labs)",
    "Does the library offer interlibrary loan services, and how quickly can I typically access materials from other institutions?",
    "Are there any maker spaces or workshops on campus, and what kind of equipment and resources are available in them (e.g., 3D printers, laser cutters)?",
    "What kind of training or support is provided for students to use the equipment in the labs and maker spaces?",
    "Are there any fees associated with using the labs, maker spaces, or other campus resources?",
    "How accessible are the campus facilities for students with disabilities?",
    "Are there dedicated computer labs for general student use, and what software is typically installed on those computers?",
    "Does the university offer any research grants or funding opportunities for students to utilize the labs and resources for their own projects?",
    "What are the policies regarding reserving lab time or equipment, and how far in advance do I need to book?"
  ],
  "Student-Faculty Ratio and Class Sizes": [
    "What is the average student-faculty ratio across all departments?",
    "How does the student-faculty ratio vary between introductory and upper-level courses?",
    "What is the typical class size for a freshman-level course in [Specific Major]?",
    "Are there any large lecture halls, and if so, what is the average size of a lecture in those halls?",
    "What is the university's policy on maximum class sizes?",
    "How many courses are taught by teaching assistants versus full professors?",
    "What opportunities are there for students to interact with professors outside of class?",
    "Does the university track student satisfaction with class sizes and faculty accessibility?",
    "How has the student-faculty ratio changed over the past 5 years, and what are the projections for the future?",
    "Are there any specific programs or initiatives designed to improve student-faculty interaction, such as mentoring or research opportunities?"
  ],
  "Student Support Services (academic advising, counseling)": [
    "What types of academic advising are available (e.g., major-specific, general)?",
    "How accessible are the academic advisors? Is it easy to schedule appointments?",
    "What is the typical caseload for an academic advisor?",
    "What kind of counseling services are offered (e.g., individual, group, crisis intervention)?",
    "Are the counselors licensed and experienced in working with college students?",
    "Is there a limit to the number of counseling sessions a student can receive?",
    "Are there any fees associated with using the counseling services?",
    "How confidential are the counseling and advising services?",
    "Are there support groups available for specific issues (e.g., anxiety, depression, grief)?",
    "What resources are available for students with learning disabilities or ADHD?"
  ],
  "Campus Culture and Student Life": [
    "What are the most popular student organizations or clubs on campus?",
    "How would you describe the overall social atmosphere on campus?",
    "Are there many opportunities for students to get involved in campus events and activities?",
    "What resources are available to support student well-being and mental health?",
    "What is the relationship like between students and faculty outside of the classroom?",
    "How diverse is the student body, and are there resources to support students from different backgrounds?",
    "What is the nightlife like around campus, and are there safe transportation options?",
    "Are there any annual campus traditions or events that students look forward to?",
    "What is the general attitude towards academics and intellectual pursuits among students?",
    "How accessible and utilized are the campus recreation facilities (gym, sports fields, etc.)?"
  ],
  "Diversity and Inclusion Initiatives": [
    "What specific programs or initiatives does the university have to support students from underrepresented backgrounds?",
    "How does the university measure the success of its diversity and inclusion initiatives?",
    "Are there any student organizations or groups focused on diversity and inclusion that I could join?",
    "What resources are available to students who experience discrimination or bias on campus?",
    "Does the university offer any scholarships or financial aid specifically for students from diverse backgrounds?",
    "How does the university promote inclusive teaching practices among its faculty?",
    "What percentage of the student body and faculty identify as belonging to underrepresented groups?",
    "Are there opportunities for students to participate in diversity and inclusion training or workshops?",
    "How does the university address issues of accessibility for students with disabilities?",
    "What is the university's policy on hate speech and bias incidents, and how is it enforced?"
  ],
  "Extracurricular Activities and Clubs": [
    "What types of extracurricular activities and clubs are most popular on campus?",
    "Are there opportunities to start my own club if I don't see one that interests me?",
    "How much of a time commitment are most extracurricular activities?",
    "Does the university provide funding or resources for clubs and organizations?",
    "Are there any clubs specifically geared towards my major (e.g., engineering, biology, etc.)?",
    "How do I find out about upcoming club events and meetings?",
    "Are there opportunities for leadership roles within clubs and organizations?",
    "Does participation in extracurricular activities improve my chances of getting internships or jobs after graduation?",
    "Are there any clubs that focus on community service or volunteering?",
    "What support systems are in place for students balancing academics and extracurricular commitments?"
  ],
  "Location and Accessibility of the University": [
    "How far is the university from the nearest major airport, and what are the transportation options?",
    "Is the university located in a safe and walkable neighborhood?",
    "What public transportation options are available to get to and from campus (e.g., buses, trains, subways)?",
    "Does the university offer any shuttle services or transportation assistance for students?",
    "How accessible is the university for students with disabilities, considering building access, transportation, and other facilities?",
    "What is the availability and cost of parking on or near campus?",
    "Are there grocery stores, restaurants, and other essential amenities within walking distance or a short commute from the university?",
    "How easy is it to travel to other parts of the city or region from the university?",
    "What is the typical commute time for students living off-campus?",
    "Does the university have bike storage facilities and promote cycling as a mode of transportation?"
  ],
  "Opportunities for International Exchange Programs": [
    "What countries and universities do you partner with for exchange programs?",
    "What are the eligibility requirements for participating in an exchange program (GPA, year of study, etc.)?",
    "What types of academic programs are available through the exchange programs?",
    "How long do the exchange programs typically last (semester, year)?",
    "What financial aid or scholarships are available to help cover the costs of an exchange program?",
    "What support services are offered to students while they are abroad (housing, health insurance, academic advising)?",
    "What is the application process like, and what are the deadlines?",
    "Are there any language requirements for specific exchange programs?",
    "How does the university ensure the safety and well-being of students participating in exchange programs?",
    "Can I earn credit towards my degree while studying abroad, and how does that process work?"
  ],
  "Networking Opportunities with Alumni": [
    "What formal programs does the university offer to connect current students with alumni for networking?",
    "Are there specific alumni networks organized by major or career field that I can join?",
    "How accessible are alumni to students seeking mentorship or informational interviews?",
    "Does the university host any alumni events on campus that students can attend?",
    "What online platforms or databases are available to search for and connect with alumni?",
    "Are there opportunities to network with alumni during career fairs or industry-specific events?",
    "How does the university prepare students to effectively network with alumni?",
    "What resources are available to help students craft compelling outreach messages to alumni?",
    "Are there any success stories of students who have benefited significantly from networking with alumni?",
    "What is the alumni engagement rate like, and how active are alumni in supporting current students?"
  ],
  "Safety and Security on Campus": [
    "What measures are in place to prevent and respond to on-campus violence?",
    "How often does campus security patrol the grounds, especially during evenings and weekends?",
    "Are there emergency call boxes or safe walk programs available for students who feel unsafe walking alone?",
    "What is the university's policy on reporting suspicious activity or potential threats?",
    "How does the university handle reports of sexual assault or harassment, and what resources are available to survivors?",
    "Are there security cameras installed in key areas around campus, such as parking lots and residence halls?",
    "What kind of training does campus security receive, and are they armed?",
    "What is the process for students to report a crime or incident to campus security?",
    "Are there any specific safety concerns or areas on campus that students should be aware of?",
    "How does the university communicate safety alerts and emergency information to students (e.g., text messages, email)?"
  ]
}